{"pages":[{"title":"About Me","text":"My name is Vivek and I am currently a final year CS undergraduate at IIIT Hyderabad.I’m pretty sure you already saw that on the widget to the left, but I figured it was worth repeating. You know. Just in case you weren’t paying attention or something. 20s can be a confusing period for most people. I’m experiencing this first hand. This blog is a place to articulate the common problems and propose some solutions.As a product of the renowned Indian Education System (:p), I may also throw some nerd stuff along the way. With that aside, I’ll be joining a company as a Software Engineer later this year. Reading After my internship last year, I did a lot of impulsive spending. Out of all the useless things, I made the right choice of buying a Kindle. I have become quite a regular reader after that. I don’t have a fixed schedule as such. I read whenever I feel like. However, seeing the kindle laying on my desk makes me want to read a few pages every now and then. This simple habit has allowed me to read a couple of books every month. I mostly read non-fiction and my favorite read is Zero to One by Peter Thiel. Fitness I made a resolution to run regularly this year. I know resolutions are full of cringe and I myself don’t make many. Luckily, I have been following this one and hope to continue doing that.Feel free to checkout my Strava Profile in the Links Section. I’m still a beginner but so is everyone at the start. I also love playing Badminton. It was my escape route from the college academics (where I was a complete misfit !!). Going to Bits Hyderabad as part of IIIT’s badminton team is the best memory of my college life. My favorite player is Lee Chong Wei.","link":"/about/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/02/03/hello-world/"}],"tags":[],"categories":[]}